# Setup SQL Database

In [2]:
## Python packages]
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import psycopg2
import pandas as pd

In [3]:
# Connection info
dbname = 'yammer_db'
username = 'davestanley'
pswd = 'coco'

In [4]:
# Connect to db
engine = create_engine('postgresql://%s:%s@localhost/%s'%(username,pswd,dbname))
print('postgresql://%s:%s@localhost/%s'%(username,pswd,dbname))
print(engine.url)
# Replace localhost with IP address if accessing a remote server

postgresql://davestanley:coco@localhost/yammer_db
postgresql://davestanley:coco@localhost/yammer_db

In [5]:
## Create DB
if not database_exists(engine.url):
    create_database(engine.url)
print(database_exists(engine.url))
print(engine.url)

True
postgresql://davestanley:coco@localhost/yammer_db

In [13]:
# Load CSV
import os

csv_path = os.path.join('.','yammer_events.csv')
data = pd.read_csv(csv_path)

In [16]:
data.head()

,user_id,occurred_at,event_type,event_name,location,device,user_type
0,10522.0,2014-05-02 11:02:39,engagement,login,Japan,dell inspiron notebook,3.0
1,10522.0,2014-05-02 11:02:53,engagement,home_page,Japan,dell inspiron notebook,3.0
2,10522.0,2014-05-02 11:03:28,engagement,like_message,Japan,dell inspiron notebook,3.0
3,10522.0,2014-05-02 11:04:09,engagement,view_inbox,Japan,dell inspiron notebook,3.0
4,10522.0,2014-05-02 11:03:16,engagement,search_run,Japan,dell inspiron notebook,3.0

In [6]:
# Run Query
con = None
con = psycopg2.connect(database = dbname, user = username, host='localhost', password=pswd)

In [17]:
## Basic test query
sql_query = """
SELECT * FROM yammer_events WHERE event_type='engagement';
"""
data_fromSQL = pd.read_sql_query(sql_query,con)

data_fromSQL.head()

,index,user_id,occurred_at,event_type,event_name,location,device,user_type
0,0,10522.0,2014-05-02 11:02:39,engagement,login,Japan,dell inspiron notebook,3.0
1,1,10522.0,2014-05-02 11:02:53,engagement,home_page,Japan,dell inspiron notebook,3.0
2,2,10522.0,2014-05-02 11:03:28,engagement,like_message,Japan,dell inspiron notebook,3.0
3,3,10522.0,2014-05-02 11:04:09,engagement,view_inbox,Japan,dell inspiron notebook,3.0
4,4,10522.0,2014-05-02 11:03:16,engagement,search_run,Japan,dell inspiron notebook,3.0

In [21]:
## Basic test query
sql_query = """
SELECT DATE_TRUNC('week', to_timestamp(e.occurred_at,'yyyy/mm/dd HH24:MI:SS')),
       COUNT(DISTINCT e.user_id) AS weekly_active_users
  FROM yammer_events e
 WHERE e.event_type = 'engagement'
   AND e.event_name = 'login'
 GROUP BY 1
 ORDER BY 1
"""
data_fromSQL = pd.read_sql_query(sql_query,con)

data_fromSQL.head()

                 date_trunc  weekly_active_users
0 2014-04-28 04:00:00+00:00                  701
1 2014-05-05 04:00:00+00:00                 1054
2 2014-05-12 04:00:00+00:00                 1094
3 2014-05-19 04:00:00+00:00                 1147
4 2014-05-26 04:00:00+00:00                 1113

In [22]:
## Basic test query
sql_query = """
SELECT DATE_TRUNC('week', to_timestamp(e.occurred_at,'yyyy/mm/dd HH24:MI:SS')),
  COUNT(DISTINCT CASE WHEN e.event_type = 'engagement' AND e.device LIKE 'macbook%' THEN e.user_id ELSE NULL END) as MacbookAll,
  COUNT(DISTINCT CASE WHEN e.event_type = 'engagement' AND e.device LIKE 'iphone%' THEN e.user_id ELSE NULL END) as iPhoneAll,
  COUNT(DISTINCT CASE WHEN e.event_type = 'engagement' AND e.device LIKE 'ipad%' THEN e.user_id ELSE NULL END) as iPadAll,
  COUNT(DISTINCT CASE WHEN e.event_type = 'engagement' AND e.device LIKE '%galaxy%' THEN e.user_id ELSE NULL END) as GalaxyAll,
  COUNT(DISTINCT CASE WHEN e.event_type = 'engagement' AND e.device LIKE 'lenovo thinkpad' THEN e.user_id ELSE NULL END) as windowsLaptop,
  COUNT(DISTINCT CASE WHEN e.event_type = 'engagement' AND e.device LIKE 'kindle fire' THEN e.user_id ELSE NULL END) as kindleFire
  FROM yammer_events e
 GROUP BY 1
 ORDER BY 1
"""
data_fromSQL = pd.read_sql_query(sql_query,con)

data_fromSQL.head()

,date_trunc,macbookall,iphoneall,ipadall,galaxyall,windowslaptop,kindlefire
0,2014-04-28 04:00:00+00:00,209,136,51,70,90,6
1,2014-05-05 04:00:00+00:00,357,231,81,105,155,26
2,2014-05-12 04:00:00+00:00,366,230,90,107,176,20
3,2014-05-19 04:00:00+00:00,367,259,86,116,177,22
4,2014-05-26 04:00:00+00:00,342,253,76,107,164,30